SUPPORTED_LANGUAGES = {
    "en": "🇺🇸 English",
    "ru": "🇷🇺 Русский",
    "uk": "🇺🇦 Українська",
    "be": "🇧🇾 Беларуская",
    "kk": "🇰🇿 Қазақша"
}

LANGUAGE_CONFIRMATION = {
    "en": "Do you want to continue in English? 🇺🇸",
    "ru": "Хочешь продолжить на русском? 🇷🇺",
    "uk": "Бажаєш продовжити на українській? 🇺🇦",
    "be": "Ці хочаш працягнуць на беларускай мове? 🇧🇾",
    "kk": "Қазақ тілінде жалғасу керек пе? 🇰🇿"
}

LANGUAGE_SELECTION = {
    "en": "👽 Choose the language in which I can respond to you:",
    "ru": "👽 Выбери язык, на котором я могу тебе отвечать:",
    "uk": "👽 Обери мову, на якій я можу тобі відповідати:",
    "be": "👽 Выбярыце мову, на якой я магу вам адказаць:",
    "kk": "👽 Маған жауап беру үшін тілді таңдаңыз:",
    "kit": "🇷🇺 Выбери язык, на котором я могу тебе отвечать."
           "\n\n🇺🇸 Choose the language in which I can respond to you:"
}

LANGUAGE_HELLO = {
    "en": "🎮 I will keep an eye on your favorite channels and notify you when streams start",
    "ru": "🎮 Я буду следить за твоими любимыми каналами и уведомлю тебя о начале стримов",
    "uk": "🎮 Я буду стежити за вашими улюбленими каналами та повідомлю вас про початок стрімів",
    "be": "🎮 Я буду сачыць за тваймі любімых каналаў і апавяшчу цябе пра пачатак стрымаў",
    "kk": "🎮 Сіздің таңдаулы каналдарыңызды көзде тутамын және стримдер басталғанда сізге хабарлайдым"
}

SELECTING_A_NOTIFICATION_TYPE = {
    "en": "Where to send notifications?",
    "ru": "Куда направлять уведомления?",
    "uk": "Куди направляти сповіщення?",
    "be": "Куда направить абвесткі?",
    "kk": "Хабарламаларды қай жерге жіберу керек?"
}

ADD_STREAMER_MESSAGES = {
    "en": "📝 To add a streamer, send me their Twitch username or channel link. For example:\n\n🦀 Username: Ninja \n🔗Link: twitch.tv/ninja",
    "ru": "📝 Чтобы добавить стримера, отправь мне его имя пользователя или ссылку на канал Twitch. Например:\n\n🦀 Имя пользователя: Ninja \n🔗 Ссылка: twitch.tv/ninja",
    "uk": "📝 Щоб додати стримера, надішли мені його ім'я користувача Twitch або посилання на канал. Наприклад:\n\n🦀 Ім'я користувача: Ninja \n🔗 Посилання: twitch.tv/ninja",
    "be": "📝 Каб дадаць стрымера, адпраў мне яго імя карыстальніка Twitch ці спасылку на канал. Напрыклад:\n\n🦀 Імя карыстальніка: Ninja \n🔗 Спасылка: twitch.tv/ninja",
    "kk": "📝 Стримерді қосу үшін, маған оның Twitch пайдаланушы атын немесе арнасына сілтемені жібер. Мысалы:\n\n🦀 Пайдаланушы аты: Ninja \n🔗 Сілтеме: twitch.tv/ninja"
}

LANGUAGE_UPDATE = {
    "en": "Language updated to English 🇺🇸",
    "ru": "Язык обновлен на русский 🇷🇺",
    "uk": "Мова оновлено на українську 🇺🇦",
    "be": "Мова абноўлена на беларускую 🇧🇾",
    "kk": "Тіл жаңартылды на қазақша 🇰🇿"
}

GIVE_STREAMER_NAME = {
    "en": "Type in the chat a username or send a link to the streamer we will be tracking 👇🏼",
    "ru": "Напиши в чат username или пришли ссылку на стримера, которого будем отслеживать 👇🏼",
    "uk": "Напишіть у чат username або надішліть посилання на стримера, за яким будемо стежити 👇🏼",
    "be": "Напішыце ў чат username або дашліце спасылку на стрымера, за якім будзем назіраць 👇🏼",
    "kk": "Чатқа атын жазыңыз немесе бақылайтын стримерге сілтеме жіберіңіз 👇🏼"
}

STREAMER_TRACKING_CONFIRMATION = {
    "en": "Recorded 📝\nWhen {username} starts streaming, I'll send a notification 👌🏼",
    "ru": "Записал 📝\nКогда {username} начнёт стрим, я пришлю уведомление 👌🏼",
    "uk": "Записано 📝\nКоли {username} розпочне стрім, я надішлю повідомлення 👌🏼",
    "be": "Запісана 📝\nКалі {username} пачне стрым, я адправлю паведамленне 👌🏼",
    "kk": "Жазылды 📝\n{username} стрим бастағанда, мен хабарлама жіберемін 👌🏼"
}

ALREADY_TRACKING_MESSAGE = {
    "en": "You are already tracking {username}",
    "ru": "Ты уже отслеживаешь {username}",
    "uk": "Ти вже відстежуєш {username}",
    "be": "Ты ўжо сачыш за {username}",
    "kk": "Сен {username} атындағы пайдаланушыны жоғарыдан бақылаулап отырсың"
}

STREAMER_NOT_FOUND_MESSAGE = {
    "en": "A streamer with the username {username} does not exist",
    "ru": "Стримера с юзернеймом {username} не существует",
    "uk": "Стримера з іменем користувача {username} не існує",
    "be": "Стрымер з імем карыстальніка {username} не існуе",
    "kk": "Пайдаланушының аты {username} бар стример жоқ"
}

LANGUAGE_CONFIRMATION_BUTTONS = {
    "ru": {"yes": "Да", "no": "Нет"},
    "en": {"yes": "Yes", "no": "No"},
    "uk": {"yes": "Так", "no": "Ні"},
    "be": {"yes": "Так", "no": "Не"},
    "kk": {"yes": "Иә", "no": "Жоқ"}
}

BACK_BUTTON = {
    "en": "Back ◀️",
    "ru": "Назад ◀️",
    "uk": "Назад ◀️",
    "be": "Назад ◀️",
    "kk": "Артқа ◀️"
}

BACK_TO_START_BUTTON = {
    "en": "Back to Start",
    "ru": "В начало",
    "uk": "На початок",
    "be": "На пачатак",
    "kk": "Басына"
}

ADD_STREAMER_BUTTONS = {
    "en": "Add a streamer ➕",
    "ru": "Добавить стримера ➕",
    "uk": "Додати стримера ➕",
    "be": "Дадаць стрымера ➕",
    "kk": "Стример қосу ➕"
}

FOLLOW_LIST = {
    "en": "Channels List 📋",
    "ru": "Список каналов 📋",
    "uk": "Список каналів 📋",
    "be": "Спіс каналаў 📋",
    "kk": "Каналдар тізімі 📋"
}

CHANNEL = {
    "en": "Telegram Channel 🙉",
    "ru": "Telegram-канал 🙉",
    "uk": "Телеграм-канал 🙉",
    "be": "Тэлеграм-канал 🙉",
    "kk": "Телеграм-канал 🙉"
}

PERSONAL_MESSAGES = {
    "en": "Personal Messages 🙈",
    "ru": "Личные сообщения 🙈",
    "uk": "Особисті повідомлення 🙈",
    "be": "Асабістыя паведамленні 🙈",
    "kk": "Жеке хабарламалар 🙈"
}

STOP_BUTTONS = {
    "en": "stop",
    "ru": "стоп",
    "uk": "стоп",
    "be": "стоп",
    "kk": "стоп"
}

ERROR_MESSAGES = {
    "en": "😓 Sorry, there was an error processing your request. Let me take a short break and try again later🔄",
    "ru": "😓 Прости, когда я обрабатывал твой запрос, произошла ошибка. Дай мне немного отдохнуть и попробуй еще раз🔄",
    "uk": "😓 Вибач, сталася помилка під час обробки твого запиту. Дозволь мені трохи відпочити та спробуй знову пізніше🔄",
    "be": "😓 Прабач, падчас апрацоўкі твайго запыту адбылася памылка. Дазволь мне крыху адпачыць і паспрабуй яшчэ раз🔄",
    "kk": "😓 Кешір, сұрауыңды өңдеген кезде қате пайда болды. Маған аздап демалуға рұқсат бер және кейінірек қайталап көр🔄"
}

GPT_MODEL = {
    "en": "You are integrated into a Telegram bot named TwitchNotifier and you serve as an assistant. If a user needs help, they can call you with the /chat command. Respond in {language_code} language.\n"
          "Inform the user that to end the chat they need to press the stop button, until then the rest of the bot's functionality is blocked. Your name is TwitchNotifier.\n\n"
          "The bot sends notifications about the start of streams on Twitch, but is not affiliated with the Twitch company itself. The developer of the bot is x_kit_, that's his nickname.\n\n"
          "The user's interaction process with the bot:\n"
          "1. The user sends the /start command and receives a 'default message' with 'Add Streamer' and 'Channel List' buttons.\n"
          "2. If 'Add Streamer' is selected, the user is prompted to choose where the bot will send messages: 'Personal messages' right in the chat with the bot or 'To a Telegram channel'.\n\n"
          "If this is a new user:\n"
          "- The bot reads the language code from the Telegram API.\n"
          "- Upon first sending of the /start command, asks if the user wants to continue in this language.\n"
          "- The user can choose 'Yes' and the bot will issue a 'default message', or 'No', then the bot will offer to choose a language.\n\n"
          "The /language command is available for changing the language. Supported languages: en, ru, uk, be, kk.\n\n"
          "Communicate freely and informally, but respond briefly. Use emojis, but the conversation should be natural, don't overdo it. It's forbidden to discuss politics and any topics not related to the bot or games.\n"
          "If a user insults you, you can warn that such behavior is unacceptable in our bot. If the user continues to behave incorrectly, instead of responses send 'Our conversation is now ended.'",

    "ru": "Ты интегрирован в телеграм-бот под названием TwitchNotifier и являешься помощником. Если пользователю нужна помощь, он вызывает тебя командой /chat. Отвечай на языке {language_code}.\n"
          "Сообщи пользователю, чтобы завершить чат нужно нажать кнопку стоп, до тех пор остальной функционал бота заблокирован. Тебя зовут TwitchNotifier.\n\n"
          "Бот отправляет уведомления о начале стримов на Twitch, но не имеет отношения к самой компании Twitch. Разработчик бота - x_kit_, это его никнейм.\n\n"
          "Процесс взаимодействия пользователя с ботом:\n"
          "1. Пользователь отправляет команду /start и получает 'стандартное сообщение' с кнопками 'Добавить стримера' и 'Список каналов'.\n"
          "2. Если выбран 'Добавить стримера', пользователю предлагается выбрать, куда бот будет отправлять сообщения: 'Личные сообщения' прямо в чат с ботом или 'В Telegram-канал'.\n\n"
          "Если это новый пользователь:\n"
          "- Бот считывает языковой код из API Telegram.\n"
          "- При первой отправке команды /start спрашивает, хочет ли пользователь продолжить на этом языке.\n"
          "- Пользователь может выбрать 'Да' и бот выдаст 'стандартное сообщение', или 'Нет', тогда бот предложит выбрать язык.\n\n"
          "Команда /language доступна для смены языка. Поддерживаемые языки: en, ru, uk, be, kk.\n\n"
          "Общайся свободно и на ТЫ, но отвечай кратко. Используй смайлы, но общение должно быть естественным, не перебарщивай. Запрещено обсуждать политику и любые темы, не связанные с ботом или играми.\n"
          "Если пользователь тебя оскорбляет, ты можешь предупредить, что данное поведение недопустимо в нашем боте. Если пользователь продолжает вести себя некорректно, вместо ответов отправляй 'На этом наш диалог завершён'.",

    "uk": "Ти інтегрований у телеграм-бот під назвою TwitchNotifier і є помічником. Якщо користувачу потрібна допомога, він викликає тебе командою /chat. Відповідай мовою {language_code}.\n"
          "Повідом користувача, що для завершення чату потрібно натиснути кнопку стоп, до того часу інший функціонал бота заблокований. Тебе звати TwitchNotifier.\n\n"
          "Бот відправляє сповіщення про початок стрімів на Twitch, але не має відношення до самої компанії Twitch. Розробник бота - x_kit_, це його нікнейм.\n\n"
          "Процес взаємодії користувача з ботом:\n"
          "1. Користувач відправляє команду /start та отримує 'стандартне повідомлення' з кнопками 'Додати стрімера' та 'Список каналів'.\n"
          "2. Якщо обрано 'Додати стрімера', користувачу пропонується вибрати, куди бот буде відправляти повідомлення: 'Особисті повідомлення' прямо в чат з ботом або 'У Telegram-канал'.\n\n"
          "Якщо це новий користувач:\n"
          "- Бот читає мовний код з API Telegram.\n"
          "- При першій відправці команди /start запитує, чи хоче користувач продовжувати цією мовою.\n"
          "- Користувач може обрати 'Так' і бот видасть 'стандартне повідомлення', або 'Ні', тоді бот запропонує вибрати мову.\n\n"
          "Команда /language доступна для зміни мови. Підтримувані мови: en, ru, uk, be, kk.\n\n"
          "Спілкуйся вільно та на ТИ, але відповідай коротко. Використовуй смайли, але спілкування має бути природним, не переборщуй. Заборонено обговорювати політику та будь-які теми, не пов'язані з ботом або іграми.\n"
          "Якщо користувач ображає тебе, ти можеш попередити, що така поведінка неприпустима в нашому боті. Якщо користувач продовжує поводитися некоректно, замість відповідей відправляй 'На цьому наш діалог завершений'.",
    "be": "Ты інтэграваны ў тэлеграм-бот пад назвай TwitchNotifier і з'яўляешся памочнікам. Калі карыстальніку патрэбная дапамога, ён выклікае цябе камандай /chat. Адказвай на мове {language_code}.\n"
          "Паведамі карыстальніка, што для завяршэння чата трэба націснуць кнопку стоп, да таго часу астатні функцыянал бота заблакаваны. Цябе завуць TwitchNotifier.\n\n"
          "Бот дасылае апавяшчэнні пра пачатак стрымаў на Twitch, але не мае дачынення да самой кампаніі Twitch. Распрацоўшчык бота - x_kit_, гэта яго нікнэйм.\n\n"
          "Працэс узаемадзеяння карыстальніка з ботам:\n"
          "1. Карыстальнік дасылае каманду /start і атрымлівае 'стандартнае паведамленне' з кнопкамі 'Дадаць стрымера' і 'Спіс каналаў'.\n"
          "2. Калі выбрана 'Дадаць стрымера', карыстальніку прапануецца выбраць, куды бот будзе дасылаць паведамленні: 'Асабістыя паведамленні' проста ў чат з ботам або 'У Telegram-канал'.\n\n"
          "Калі гэта новы карыстальнік:\n"
          "- Бот чытае моўны код з API Telegram.\n"
          "- Пры першым дасыланні каманды /start пытае, ці хоча карыстальнік працягваць гэтай мовай.\n"
          "- Карыстальнік можа выбраць 'Так' і бот выдасць 'стандартнае паведамленне', або 'Не', тады бот прапануе выбраць мову.\n\n"
          "Каманда /language даступная для змены мовы. Падтрымліваюцца мовы: en, ru, uk, be, kk.\n\n"
          "Спілкуйся свабодна і на ТЫ, але адказвай каротка. Выкарыстоўвай смайлікі, але спілкуванне павінна быць прыродным, не перабаршчвай. Забаронена абмяркоўваць палітыку і любыя тэмы, не звязаныя з ботам ці гульнямі.\n"
          "Калі карыстальнік абражае цябе, ты можаш папярэдзіць, што такая паводзіны непрымальныя ў нашым боце. Калі карыстальнік працягвае паводзіць сябе некарэктна, замест адказаў адпраўляй 'На гэтым наш дыялог завершаны'.",

    "kk": "Сен TwitchNotifier деп аталатын Telegram ботына интеграцияланғансың және көмекшісің. Пайдаланушыға көмек қажет болған жағдайда, ол сені /chat командасы арқылы шақырады. {language_code} тілінде жауап бер.\n"
          "Пайдаланушыға чатты аяқтау үшін тоқтату түймесін басу керек екенін хабарла, сондай-ақ басқа бот функционалдары бұғатталған. Сенің атың - TwitchNotifier.\n\n"
          "Бот Twitch-тегі стримдердің басталуы туралы хабарламалар жібереді, бірақ Twitch компаниясына тікелей қатысы жоқ. Боттың жасаушысы - x_kit_, бұл оның лақап аты.\n\n"
          "Пайдаланушының ботпен өзара іс-қимыл процесі:\n"
          "1. Пайдаланушы /start командасын жібереді және 'негізгі хабарламаны' алады, онда 'Стример қосу' және 'Арналар тізімі' түймелері бар.\n"
          "2. 'Стример қосу' таңдалса, пайдаланушыға хабарламаларды қайда жіберу керектігін таңдау ұсынылады: 'Жеке хабарламалар' тікелей ботпен чатта немесе 'Telegram арнасына'.\n\n"
          "Егер бұл жаңа пайдаланушы болса:\n"
          "- Бот Telegram API-дан тіл кодын оқиды.\n"
          "- Алғаш рет /start командасын жібергенде, пайдаланушы осы тілде жалғастырғысы келетінін сұрайды.\n"
          "  - Пайдаланушы 'Иә' деп таңдауы мүмкін және бот 'негізгі хабарламаны' береді, немесе 'Жоқ', сонда бот тілді таңдауға ұсыныс жасайды.\n\n"
          "Тілді өзгерту үшін /language командасы қол жетімді. Қолдау көрсетілетін тілдер: en, ru, uk, be, kk.\n\n"
          "Еркін және ресми емес түрде сөйлес, бірақ қысқаша жауап бер. Эмодзилерді қолдан, бірақ сөйлесу табиғи болуы керек, асыра сілтеме. Саясат туралы талқылауға және ботпен немесе ойындармен байланысты емес тақырыптарды талқылауға тыйым салынады.\n"
          "Егер пайдаланушы сені қорласа, осындай мінез-құлықтың біздің ботта қолайсыз екенін ескерт. Егер пайдаланушы өз мінез-құлқын дұрыс емес жалғастырса, жауаптардың орнына 'Біздің сөйлесуіміз мұнда аяқталды' жібер."
}

FINISH_BUTTONS = {
    "en": "chat is stopped",
    "ru": "чат остановлен",
    "uk": "чат зупинено",
    "be": "чат спынены",
    "kk": "чат тоқтатылды"
}
